<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/cc0aba8c-e5e8-44b6-9d79-bcaeed3bbd58/terraform-bin -chdir=terraform show -no-color /tmp/plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_appautoscaling_target.ecs_target will be updated in-place
  ~ resource "aws_appautoscaling_target" "ecs_target" {
        id                 = "service/staging_keyserver_cluster/staging_keyserver-service"
      ~ role_arn           = "arn:aws:iam::898587786287:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> "arn:aws:iam::898587786287:role/staging_keyserver-ecs-scale-application"
        # (5 unchanged attributes hidden)
    }

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging_keyserver_cluster/staging_keyserver-service"
        name                               = "staging_keyserver-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_keyserver:35" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task must be replaced
-/+ resource "aws_ecs_task_definition" "app_task" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_keyserver:33" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "staging_keyserver" -> (known after apply)
      ~ revision                 = 33 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.keystore-docdb.aws_docdb_cluster.docdb_primary has moved to module.keystore_docdb.aws_docdb_cluster.docdb_primary
    resource "aws_docdb_cluster" "docdb_primary" {
        id                              = "staging-keyserver-keystore-docdb-primary-cluster"
        tags                            = {}
        # (25 unchanged attributes hidden)
    }

  # module.keystore_docdb.aws_docdb_cluster_instance.docdb_instances[0] will be updated in-place
  # (moved from module.keystore-docdb.aws_docdb_cluster_instance.docdb_instances[0])
  ~ resource "aws_docdb_cluster_instance" "docdb_instances" {
        id                           = "staging-keyserver-keystore-docdb-primary-instance-0"
      ~ instance_class               = "db.r5.large" -> "db.r6g.large"
        tags                         = {}
        # (20 unchanged attributes hidden)
    }

  # module.keystore-docdb.aws_docdb_subnet_group.private_subnets has moved to module.keystore_docdb.aws_docdb_subnet_group.private_subnets
    resource "aws_docdb_subnet_group" "private_subnets" {
        id          = "staging-keyserver-keystore-docdb-private-subnet-group"
        name        = "staging-keyserver-keystore-docdb-private-subnet-group"
        tags        = {}
        # (4 unchanged attributes hidden)
    }

  # module.keystore-docdb.aws_kms_key.docdb_encryption has moved to module.keystore_docdb.aws_kms_key.docdb_encryption
    resource "aws_kms_key" "docdb_encryption" {
        id                                 = "00547049-a22c-49cf-9b00-a3d43b99067b"
        tags                               = {}
        # (10 unchanged attributes hidden)
    }

  # module.keystore-docdb.aws_secretsmanager_secret.master_password has moved to module.keystore_docdb.aws_secretsmanager_secret.master_password
    resource "aws_secretsmanager_secret" "master_password" {
        id                             = "arn:aws:secretsmanager:eu-central-1:898587786287:secret:staging-keyserver-keystore-docdb-master-password-jyiAwz"
        name                           = "staging-keyserver-keystore-docdb-master-password"
        tags                           = {}
        # (5 unchanged attributes hidden)
    }

  # module.keystore-docdb.aws_secretsmanager_secret_version.master_password has moved to module.keystore_docdb.aws_secretsmanager_secret_version.master_password
    resource "aws_secretsmanager_secret_version" "master_password" {
        id             = "arn:aws:secretsmanager:eu-central-1:898587786287:secret:staging-keyserver-keystore-docdb-master-password-jyiAwz|40D80383-A9F2-41D9-AC9F-2A498D3FCDFF"
        # (5 unchanged attributes hidden)
    }

  # module.keystore-docdb.aws_security_group.service_security_group has moved to module.keystore_docdb.aws_security_group.service_security_group
    resource "aws_security_group" "service_security_group" {
        id                     = "sg-03dca8e0a7efaa002"
        name                   = "staging-keyserver-keystore-docdb-service"
        tags                   = {}
        # (8 unchanged attributes hidden)
    }

  # module.keystore-docdb.random_password.master_password has moved to module.keystore_docdb.random_password.master_password
    resource "random_password" "master_password" {
        id          = "none"
        # (12 unchanged attributes hidden)
    }

  # module.keystore-docdb.module.docdb-autoscaling.aws_cloudwatch_log_group.main has moved to module.keystore_docdb.module.docdb-autoscaling.aws_cloudwatch_log_group.main
    resource "aws_cloudwatch_log_group" "main" {
        id                = "/aws/lambda/staging-keyserver-docdb-autoscaling"
        name              = "/aws/lambda/staging-keyserver-docdb-autoscaling"
        tags              = {}
        # (3 unchanged attributes hidden)
    }

  # module.keystore-docdb.module.docdb-autoscaling.aws_cloudwatch_metric_alarm.main[0] has moved to module.keystore_docdb.module.docdb-autoscaling.aws_cloudwatch_metric_alarm.main[0]
    resource "aws_cloudwatch_metric_alarm" "main" {
        id                        = "staging-keyserver-docdb-autoscaling-0"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.keystore-docdb.module.docdb-autoscaling.aws_iam_policy.lambda has moved to module.keystore_docdb.module.docdb-autoscaling.aws_iam_policy.lambda
    resource "aws_iam_policy" "lambda" {
        id        = "arn:aws:iam::898587786287:policy/staging-keyserver-docdb-autoscaling-eu-central-1-policy"
        name      = "staging-keyserver-docdb-autoscaling-eu-central-1-policy"
        tags      = {}
        # (5 unchanged attributes hidden)
    }

  # module.keystore-docdb.module.docdb-autoscaling.aws_iam_role.lambda has moved to module.keystore_docdb.module.docdb-autoscaling.aws_iam_role.lambda
    resource "aws_iam_role" "lambda" {
        id                    = "staging-keyserver-docdb-autoscaling-eu-central-1-role"
        name                  = "staging-keyserver-docdb-autoscaling-eu-central-1-role"
        tags                  = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.keystore-docdb.module.docdb-autoscaling.aws_iam_role_policy_attachment.lambda has moved to module.keystore_docdb.module.docdb-autoscaling.aws_iam_role_policy_attachment.lambda
    resource "aws_iam_role_policy_attachment" "lambda" {
        id         = "staging-keyserver-docdb-autoscaling-eu-central-1-role-20230512122742733400000001"
        # (2 unchanged attributes hidden)
    }

  # module.keystore_docdb.module.docdb-autoscaling.aws_lambda_function.main will be updated in-place
  # (moved from module.keystore-docdb.module.docdb-autoscaling.aws_lambda_function.main)
  ~ resource "aws_lambda_function" "main" {
      ~ filename                       = ".terraform/modules/keystore-docdb.docdb-autoscaling/.files/init.zip" -> ".terraform/modules/keystore_docdb.docdb-autoscaling/.files/init.zip"
        id                             = "staging-keyserver-docdb-autoscaling"
      ~ last_modified                  = "2023-05-12T12:27:56.911+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.keystore-docdb.module.docdb-autoscaling.aws_lambda_permission.sns has moved to module.keystore_docdb.module.docdb-autoscaling.aws_lambda_permission.sns
    resource "aws_lambda_permission" "sns" {
        id            = "AllowSubscriptionToSNS"
        # (5 unchanged attributes hidden)
    }

  # module.keystore-docdb.module.docdb-autoscaling.aws_sns_topic.main has moved to module.keystore_docdb.module.docdb-autoscaling.aws_sns_topic.main
    resource "aws_sns_topic" "main" {
        id                                       = "arn:aws:sns:eu-central-1:898587786287:staging-keyserver-docdb-autoscaling"
        name                                     = "staging-keyserver-docdb-autoscaling"
        tags                                     = {}
        # (11 unchanged attributes hidden)
    }

  # module.keystore-docdb.module.docdb-autoscaling.aws_sns_topic_subscription.main has moved to module.keystore_docdb.module.docdb-autoscaling.aws_sns_topic_subscription.main
    resource "aws_sns_topic_subscription" "main" {
        id                              = "arn:aws:sns:eu-central-1:898587786287:staging-keyserver-docdb-autoscaling:5cfe903a-4b46-4a46-9b64-c95d04819165"
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 4 to change, 1 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # module.ecs.aws_appautoscaling_target.ecs_target will be updated in-place%0A  ~ resource "aws_appautoscaling_target" "ecs_target" {%0A        id                 = "service/staging_keyserver_cluster/staging_keyserver-service"%0A      ~ role_arn           = "arn:aws:iam::898587786287:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> "arn:aws:iam::898587786287:role/staging_keyserver-ecs-scale-application"%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_service.app_service will be updated in-place%0A  ~ resource "aws_ecs_service" "app_service" {%0A        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging_keyserver_cluster/staging_keyserver-service"%0A        name                               = "staging_keyserver-service"%0A        tags                               = {}%0A      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_keyserver:35" -> (known after apply)%0A        # (14 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_task_definition.app_task must be replaced%0A-/+ resource "aws_ecs_task_definition" "app_task" {%0A      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_keyserver:33" -> (known after apply)%0A      ~ container_definitions    = (sensitive value) # forces replacement%0A      ~ id                       = "staging_keyserver" -> (known after apply)%0A      ~ revision                 = 33 -> (known after apply)%0A      - tags                     = {} -> null%0A        # (9 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.keystore-docdb.aws_docdb_cluster.docdb_primary has moved to module.keystore_docdb.aws_docdb_cluster.docdb_primary%0A    resource "aws_docdb_cluster" "docdb_primary" {%0A        id                              = "staging-keyserver-keystore-docdb-primary-cluster"%0A        tags                            = {}%0A        # (25 unchanged attributes hidden)%0A    }%0A%0A  # module.keystore_docdb.aws_docdb_cluster_instance.docdb_instances[0] will be updated in-place%0A  # (moved from module.keystore-docdb.aws_docdb_cluster_instance.docdb_instances[0])%0A  ~ resource "aws_docdb_cluster_instance" "docdb_instances" {%0A        id                           = "staging-keyserver-keystore-docdb-primary-instance-0"%0A      ~ instance_class               = "db.r5.large" -> "db.r6g.large"%0A        tags                         = {}%0A        # (20 unchanged attributes hidden)%0A    }%0A%0A  # module.keystore-docdb.aws_docdb_subnet_group.private_subnets has moved to module.keystore_docdb.aws_docdb_subnet_group.private_subnets%0A    resource "aws_docdb_subnet_group" "private_subnets" {%0A        id          = "staging-keyserver-keystore-docdb-private-subnet-group"%0A        name        = "staging-keyserver-keystore-docdb-private-subnet-group"%0A        tags        = {}%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A  # module.keystore-docdb.aws_kms_key.docdb_encryption has moved to module.keystore_docdb.aws_kms_key.docdb_encryption%0A    resource "aws_kms_key" "docdb_encryption" {%0A        id                                 = "00547049-a22c-49cf-9b00-a3d43b99067b"%0A        tags                               = {}%0A        # (10 unchanged attributes hidden)%0A    }%0A%0A  # module.keystore-docdb.aws_secretsmanager_secret.master_password has moved to module.keystore_docdb.aws_secretsmanager_secret.master_password%0A    resource "aws_secretsmanager_secret" "master_password" {%0A        id                             = "arn:aws:secretsmanager:eu-central-1:898587786287:secret:staging-keyserver-keystore-docdb-master-password-jyiAwz"%0A        name                           = "staging-keyserver-keystore-docdb-master-password"%0A        tags                           = {}%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.keystore-docdb.aws_secretsmanager_secret_version.master_password has moved to module.keystore_docdb.aws_secretsmanager_secret_version.master_password%0A    resource "aws_secretsmanager_secret_version" "master_password" {%0A        id             = "arn:aws:secretsmanager:eu-central-1:898587786287:secret:staging-keyserver-keystore-docdb-master-password-jyiAwz|40D80383-A9F2-41D9-AC9F-2A498D3FCDFF"%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.keystore-docdb.aws_security_group.service_security_group has moved to module.keystore_docdb.aws_security_group.service_security_group%0A    resource "aws_security_group" "service_security_group" {%0A        id                     = "sg-03dca8e0a7efaa002"%0A        name                   = "staging-keyserver-keystore-docdb-service"%0A        tags                   = {}%0A        # (8 unchanged attributes hidden)%0A    }%0A%0A  # module.keystore-docdb.random_password.master_password has moved to module.keystore_docdb.random_password.master_password%0A    resource "random_password" "master_password" {%0A        id          = "none"%0A        # (12 unchanged attributes hidden)%0A    }%0A%0A  # module.keystore-docdb.module.docdb-autoscaling.aws_cloudwatch_log_group.main has moved to module.keystore_docdb.module.docdb-autoscaling.aws_cloudwatch_log_group.main%0A    resource "aws_cloudwatch_log_group" "main" {%0A        id                = "/aws/lambda/staging-keyserver-docdb-autoscaling"%0A        name              = "/aws/lambda/staging-keyserver-docdb-autoscaling"%0A        tags              = {}%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # module.keystore-docdb.module.docdb-autoscaling.aws_cloudwatch_metric_alarm.main[0] has moved to module.keystore_docdb.module.docdb-autoscaling.aws_cloudwatch_metric_alarm.main[0]%0A    resource "aws_cloudwatch_metric_alarm" "main" {%0A        id                        = "staging-keyserver-docdb-autoscaling-0"%0A        tags                      = {}%0A        # (17 unchanged attributes hidden)%0A    }%0A%0A  # module.keystore-docdb.module.docdb-autoscaling.aws_iam_policy.lambda has moved to module.keystore_docdb.module.docdb-autoscaling.aws_iam_policy.lambda%0A    resource "aws_iam_policy" "lambda" {%0A        id        = "arn:aws:iam::898587786287:policy/staging-keyserver-docdb-autoscaling-eu-central-1-policy"%0A        name      = "staging-keyserver-docdb-autoscaling-eu-central-1-policy"%0A        tags      = {}%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.keystore-docdb.module.docdb-autoscaling.aws_iam_role.lambda has moved to module.keystore_docdb.module.docdb-autoscaling.aws_iam_role.lambda%0A    resource "aws_iam_role" "lambda" {%0A        id                    = "staging-keyserver-docdb-autoscaling-eu-central-1-role"%0A        name                  = "staging-keyserver-docdb-autoscaling-eu-central-1-role"%0A        tags                  = {}%0A        # (9 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.keystore-docdb.module.docdb-autoscaling.aws_iam_role_policy_attachment.lambda has moved to module.keystore_docdb.module.docdb-autoscaling.aws_iam_role_policy_attachment.lambda%0A    resource "aws_iam_role_policy_attachment" "lambda" {%0A        id         = "staging-keyserver-docdb-autoscaling-eu-central-1-role-20230512122742733400000001"%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # module.keystore_docdb.module.docdb-autoscaling.aws_lambda_function.main will be updated in-place%0A  # (moved from module.keystore-docdb.module.docdb-autoscaling.aws_lambda_function.main)%0A  ~ resource "aws_lambda_function" "main" {%0A      ~ filename                       = ".terraform/modules/keystore-docdb.docdb-autoscaling/.files/init.zip" -> ".terraform/modules/keystore_docdb.docdb-autoscaling/.files/init.zip"%0A        id                             = "staging-keyserver-docdb-autoscaling"%0A      ~ last_modified                  = "2023-05-12T12:27:56.911+0000" -> (known after apply)%0A        tags                           = {}%0A        # (18 unchanged attributes hidden)%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # module.keystore-docdb.module.docdb-autoscaling.aws_lambda_permission.sns has moved to module.keystore_docdb.module.docdb-autoscaling.aws_lambda_permission.sns%0A    resource "aws_lambda_permission" "sns" {%0A        id            = "AllowSubscriptionToSNS"%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.keystore-docdb.module.docdb-autoscaling.aws_sns_topic.main has moved to module.keystore_docdb.module.docdb-autoscaling.aws_sns_topic.main%0A    resource "aws_sns_topic" "main" {%0A        id                                       = "arn:aws:sns:eu-central-1:898587786287:staging-keyserver-docdb-autoscaling"%0A        name                                     = "staging-keyserver-docdb-autoscaling"%0A        tags                                     = {}%0A        # (11 unchanged attributes hidden)%0A    }%0A%0A  # module.keystore-docdb.module.docdb-autoscaling.aws_sns_topic_subscription.main has moved to module.keystore_docdb.module.docdb-autoscaling.aws_sns_topic_subscription.main%0A    resource "aws_sns_topic_subscription" "main" {%0A        id                              = "arn:aws:sns:eu-central-1:898587786287:staging-keyserver-docdb-autoscaling:5cfe903a-4b46-4a46-9b64-c95d04819165"%0A        # (10 unchanged attributes hidden)%0A    }%0A%0APlan: 1 to add, 4 to change, 1 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Action: `pull_request`*